УТ.УчетЗадач/src/InformationRegisters/cbr_ВопросыПоЗадачам/cbr_ВопросыПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ВопросыПоЗадачам</name>
  <resources>
    <name>ТекстВопроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВопроса</name>
    <type>
      <types>EnumRef.cbr_ВидыВопросов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ВопросыПоЗадачам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Создать запись в регистр сведений
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  Адресат - СправочникСсылка.Пользователи
//  Текст - Строка
//  ВидВопроса - ПеречислениеСсылка.cbr_ВидыВопросов.
Процедура ЗаписатьВопрос(Задача, Адресат, Текст, ВидВопроса) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Адресат = Адресат;
	МенеджерЗаписи.Отправитель = Пользователи.АвторизованныйПользователь();
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Период = МенеджерЗаписи.Дата;
	МенеджерЗаписи.ТекстВопроса = Текст;
	МенеджерЗаписи.ВидВопроса = ВидВопроса;
	МенеджерЗаписи.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли
